eet-energy/picberry/src/devices/dspic33epxxgs50x.cpp
	/* WRITE CONFIGURATION REGISTERS */
	if(flags.debug)
		cerr << endl << "Writing Configuration registers..." << endl;

	//  Exit the Reset vector.
	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	/* Initialize the TBLPAG register for writing to the latches */
	send_cmd(0x200FAC); // MOV #0xFA, W12
	send_cmd(0x8802AC); // MOV W12, TBLPAG

	for(i=0; i<8; i++)
	{
		addr = config_addr[i];

		if(mem.filled[addr]){

			/* Load W0:W1 with the next two Configuration Words to program. */
			send_cmd(0x200000 | ((0x0000FFFF & mem.location[addr]) << 4));
			send_cmd(0x200001 | ((mem.location[addr] & 0x00FF0000) >> 12) );
			send_cmd(0x2FFFF2);//send_cmd(0x200002 | ((0x0000FFFF & mem.location[addr+1]) << 4));
			send_cmd(0x2FFFF3);//send_cmd(0x200003 | ((mem.location[addr+1] & 0x00FF0000) >> 12) );

			/* Set the Write Pointer (W3) and load the write latches.*/
			send_cmd(0xEB0300);
			send_nop();
			send_cmd(0xBB0B00);
			send_nop();
			send_nop();
			send_cmd(0xBB9B01);
			send_nop();
			send_nop();
			send_cmd(0xBB0B02);
			send_nop();
			send_nop();
			send_cmd(0xBB9B03);
			send_nop();
			send_nop();

			/* Set the NVMADRU/NVMADR register pair to point to the correct Configuration Word address */
			send_cmd(0x200004 | ((addr & 0x0000FFFF) << 4) ); // MOV #<DestinationAddress15:0>, W3
			send_cmd(0x200005 | ((addr & 0x00FF0000) >> 12) ); // MOV #<DestinationAddress23:16>, W4
			send_cmd(0x883954);	//MOV W4, NVMADR
			send_cmd(0x883965);	//MOV W5, NVMADRU

			/*  Set the NVMCON register to program two instruction words.*/
			send_cmd(0x24001A); // MOV #0x4001, W10
			send_nop();
			send_cmd(0x88394A); // MOV W10, NVMCON
			send_nop();
			send_nop();

			/* Initiate the write cycle */
			send_cmd(0x200551);	// MOV #0x55, W1
			send_cmd(0x883971);	// W1, NVMKEY
			send_cmd(0x200AA1);	// MOV #0xAA, W1
			send_cmd(0x883971);	// MOV W1, NVMKEY
			send_cmd(0xA8E729);	// BSET NVMCON, #WR
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();

			/* Generate clock pulses for program operation to complete until the WR bit is clear */

			do{
				send_nop();
				send_cmd(0x803940);
				send_nop();
				send_cmd(0x887C40);
				send_nop();
				nvmcon = read_data();
				send_nop();
				send_nop();
				send_nop();
				reset_pc();
				send_nop();
				send_nop();
				send_nop();
			} while((nvmcon & 0x8000) == 0x8000);
		} else if(flags.debug)
				fprintf(stderr,"\n - %s left unchanged", regname[i]);

		addr = addr+2;
	}

	if(flags.debug) cerr << endl;

	delay_us(100000);

	// TODO

	/* VERIFY CODE MEMORY */
	if(!flags.noverify){
		if(!flags.debug) cerr << "[ 0%]";
		if(flags.client) fprintf(stdout, "@000");
		counter = 0;

		send_nop();
		send_nop();
		send_nop();
		reset_pc();
		send_nop();
		send_nop();
		send_nop();

		for(addr=0; addr < mem.code_memory_size; addr=addr+8) {

			skip=1;

			for(k=0; k<8; k+=2)
				if(mem.filled[addr+k])
					skip = 0;

			if(skip) continue;

			send_cmd(0x200000 | ((addr & 0x00FF0000) >> 12) );	// MOV #<DestAddress23:16>, W0
			send_cmd(0x8802A0);									// MOV W0, TBLPAG
			send_cmd(0x200006 | ((addr & 0x0000FFFF) << 4) );	// MOV #<DestAddress15:0>, W6

			/* Fetch the next four memory locations and put them to W0:W5 */
			send_cmd(0xEB0380);	// CLR W7
			send_nop();
			send_cmd(0xBA1B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBD6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA1BB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA1B96);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBADBD6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_cmd(0xBA0BB6);
			send_nop();
			send_nop();
			send_nop();
			send_nop();
			send_nop();

			/* read six data words (16 bits each) */
			for(i=0; i<6; i++){
				send_cmd(0x887C40 + i);
				send_nop();
				raw_data[i] = read_data();
				send_nop();
			}

			send_nop();
			send_nop();
			send_nop();
			reset_pc();
			send_nop();
			send_nop();
			send_nop();

			/* store data correctly */
			data[0] = raw_data[0];
			data[1] = raw_data[1] & 0x00FF;
			data[3] = (raw_data[1] & 0xFF00) >> 8;
			data[2] = raw_data[2];
			data[4] = raw_data[3];
			data[5] = raw_data[4] & 0x00FF;
			data[7] = (raw_data[4] & 0xFF00) >> 8;
			data[6] = raw_data[5];

			for(i=0; i<8; i++){
				if (flags.debug)
					fprintf(stderr, "\n addr = 0x%06X data = 0x%04X", (addr+i), data[i]);

				if(mem.filled[addr+i] && data[i] != mem.location[addr+i]){
					fprintf(stderr,"\n\n ERROR at address %06X: written %04X but %04X read!\n\n",
									addr+i, mem.location[addr+i], data[i]);
					return;
				}

			}

			if(counter != addr*100/filled_locations){
				if(flags.client)
					fprintf(stdout,"@%03d", (addr*100/(filled_locations+0x100)));
				if(!flags.debug)
					fprintf(stderr,"\b\b\b\b\b[%2d%%]", addr*100/(filled_locations+0x100));
				counter = addr*100/filled_locations;
			}
		}

		if(!flags.debug) cerr << "\b\b\b\b\b";
		if(flags.client) fprintf(stdout, "@FIN");
	}
	else{
		if(flags.client) fprintf(stdout, "@FIN");
	}
}

/* write to screen the configuration registers, without saving them anywhere */
void dspic33epxxgs50x::dump_configuration_registers(void)
{
	const char *regname[] = {"FGS","FOSCSEL","FOSC","FWDT","FPOR",
							"FICD","FAS","FUID0"};

	cerr << endl << "Configuration registers:" << endl << endl;

	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();

	send_cmd(0x200F80);
	send_cmd(0x8802A0);
	send_cmd(0x200046);
	send_cmd(0x20F887);
	send_nop();

	for(unsigned short i=0; i<8; i++){
		send_cmd(0xBA0BB6);
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		send_nop();
		fprintf(stderr," - %s: 0x%02x\n", regname[i], read_data());
	}

	cerr << endl;

	send_nop();
	send_nop();
	send_nop();
	reset_pc();
	send_nop();
	send_nop();
	send_nop();
}

